In [1]:
import numpy as np
import pandas as pd
import warnings as wr
wr.filterwarnings('ignore')

In [2]:
df = pd.read_csv('supershops.csv') #load csv data set

In [3]:
df.head() # Shows the 1st 5 rows by default

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [4]:
df.head(10) # Shows 1st 10 rows of dataframe

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94
5        131876.90        99814.71  362861.36    Dhaka  156991.12
6        134615.46       147198.87  127716.82      Ctg  156122.51
7        130298.13       145530.06  323876.68  Rangpur  155752.60
8        120542.52       148718.95  311613.29    Dhaka  152211.77
9        123334.88       108679.17  304981.62      Ctg  149759.96

In [5]:
df.tail(10)# Shows Last 10 rows of dataframe

    Marketing Spend  Administration  Transport     Area    Profit
40         28754.33       118546.05  172795.67      Ctg  78239.91
41         27892.92        84710.77  164470.71  Rangpur  77798.83
42         23640.93        96189.63  148001.11      Ctg  71498.49
43         15505.73       127382.30   35534.17    Dhaka  69758.98
44         22177.74       154806.14   28334.72      Ctg  65200.33
45          1000.23       124153.04    1903.93    Dhaka  64926.08
46          1315.46       115816.21  297114.46  Rangpur  49490.75
47             0.00       135426.92       0.00      Ctg  42559.73
48           542.05        51743.15       0.00    Dhaka  35673.41
49             0.00       116983.80   45173.06      Ctg  14681.40

In [6]:
df.info() # Shows information about all variables or features

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [7]:
x = df.drop('Profit', axis=1) # drop target variable / 1 for column
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [8]:
y = df['Profit']

In [9]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Standard Scaler

In [10]:
#import standardscaler library 
from sklearn.preprocessing import StandardScaler
std = StandardScaler()

In [11]:
#transformation only feature , don't transform Y variable means target variable
df_ad = std.fit(df[['Administration']])  # fit at first then transform

In [12]:
df_ad

StandardScaler(copy=True, with_mean=True, with_std=True)

In [13]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [14]:
df.Administration = std.transform(df[['Administration']]) # transform the column 'Administration'

In [15]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753  471784.10    Dhaka  192261.83
1        162597.70        1.082807  443898.53      Ctg  191792.06
2        153441.51       -0.728257  407934.54  Rangpur  191050.39
3        144372.41       -0.096365  383199.62    Dhaka  182901.99
4        142107.34       -1.079919  366168.42  Rangpur  166187.94

In [16]:
df.Transport = std.fit_transform(df[['Transport']]) # transform the column 'Transport'

In [17]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61        0.560753   2.165287    Dhaka  192261.83
1        162597.70        1.082807   1.929843      Ctg  191792.06
2        153441.51       -0.728257   1.626191  Rangpur  191050.39
3        144372.41       -0.096365   1.417348    Dhaka  182901.99
4        142107.34       -1.079919   1.273550  Rangpur  166187.94

In [18]:
df.Marketing Spend=std.transform(df['Marketing Spend'])
df.head()

SyntaxError: invalid syntax (<ipython-input-18-b6a6469607c1>, line 1)

### Renaming Column

In [19]:
# Thre is a problem when the column name contains blank space, to solve the issue we will rename the culumn name
df.rename(columns={'Marketing Spend': 'Spend'},inplace = True)
df.head()

       Spend  Administration  Transport     Area     Profit
0  114523.61        0.560753   2.165287    Dhaka  192261.83
1  162597.70        1.082807   1.929843      Ctg  191792.06
2  153441.51       -0.728257   1.626191  Rangpur  191050.39
3  144372.41       -0.096365   1.417348    Dhaka  182901.99
4  142107.34       -1.079919   1.273550  Rangpur  166187.94

In [20]:
df.Spend=std.fit_transform(df[['Spend']]) # Note that the column namne must be within double square bracket

In [21]:
df.head()

      Spend  Administration  Transport     Area     Profit
0  0.897913        0.560753   2.165287    Dhaka  192261.83
1  1.955860        1.082807   1.929843      Ctg  191792.06
2  1.754364       -0.728257   1.626191  Rangpur  191050.39
3  1.554784       -0.096365   1.417348    Dhaka  182901.99
4  1.504937       -1.079919   1.273550  Rangpur  166187.94

### LOOP : Standard Scaler

In [22]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Marketing Spend  50 non-null     float64
 1   Administration   50 non-null     float64
 2   Transport        49 non-null     float64
 3   Area             50 non-null     object
dtypes: float64(3), object(1)
memory usage: 1.7+ KB

In [23]:
x.dtypes['Marketing Spend']

dtype('float64')

In [24]:
x.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area'], dtype='object')

In [25]:
x.shape

(50, 4)

In [26]:
x.describe()

       Marketing Spend  Administration      Transport
count        50.000000       50.000000      49.000000
mean      73721.615600   121344.639600  215331.732449
std       45902.256482    28017.802755  119665.391550
min           0.000000    51283.140000       0.000000
25%       39936.370000   103730.875000  134050.070000
50%       73051.080000   122699.795000  214634.810000
75%      101602.800000   144842.180000  299737.290000
max      165349.200000   182645.560000  471784.100000

In [27]:
std = StandardScaler()

for column in x.columns:
    if  x.dtypes[column] != object:
        x[column] = std.fit_transform(x[[column]])

In [28]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

### MinMax Scaler

In [29]:
from sklearn.preprocessing import MinMaxScaler

min_max_scale = MinMaxScaler()
df['Spend'] = min_max_scale.fit_transform(df[['Spend']])
df['Administration'] = min_max_scale.fit_transform(df[['Administration']])
df['Transport'] = min_max_scale.fit_transform(df[['Transport']])

In [30]:
df.head()

      Spend  Administration  Transport     Area     Profit
0  0.692617        0.651744   1.000000    Dhaka  192261.83
1  0.983359        0.761972   0.940893      Ctg  191792.06
2  0.927985        0.379579   0.864664  Rangpur  191050.39
3  0.873136        0.512998   0.812235    Dhaka  182901.99
4  0.859438        0.305328   0.776136  Rangpur  166187.94

In [31]:
for column in x.columns:
    if  x.dtypes[column] != object:
        x[column] = min_max_scale.fit_transform(x[[column]])

In [32]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

### MaxAbsScaler

In [33]:
from sklearn.preprocessing import MaxAbsScaler
max_abs_scale = MaxAbsScaler()
df['Spend'] = max_abs_scale.fit_transform(df[['Spend']])
df['Administration'] = max_abs_scale.fit_transform(df[['Administration']])
df['Transport'] = max_abs_scale.fit_transform(df[['Transport']])

In [34]:
df.head()

      Spend  Administration  Transport     Area     Profit
0  0.692617        0.651744   1.000000    Dhaka  192261.83
1  0.983359        0.761972   0.940893      Ctg  191792.06
2  0.927985        0.379579   0.864664  Rangpur  191050.39
3  0.873136        0.512998   0.812235    Dhaka  182901.99
4  0.859438        0.305328   0.776136  Rangpur  166187.94

In [35]:
for column in x.columns:
    if  x.dtypes[column] != object:
        x[column] = max_abs_scale.fit_transform(x[[column]])

In [36]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

### Robust Scaler

In [37]:
from sklearn.preprocessing import RobustScaler
transformer = RobustScaler()
df['Spend'] = transformer.fit_transform(df[['Spend']])
df['Administration'] =transformer.fit_transform(df[['Administration']])
df['Transport'] = transformer.fit_transform(df[['Transport']])

In [38]:
df.head()

      Spend  Administration  Transport     Area     Profit
0  0.672530        0.345355   1.552016    Dhaka  192261.83
1  1.452113        0.697565   1.383714      Ctg  191792.06
2  1.303634       -0.524290   1.166654  Rangpur  191050.39
3  1.156567       -0.097977   1.017368    Dhaka  182901.99
4  1.119836       -0.761543   0.914576  Rangpur  166187.94

In [39]:
x['Marketing Spend'] = transformer.fit_transform(df[['Spend']])
x['Administration'] =transformer.fit_transform(df[['Administration']])
x['Transport'] = transformer.fit_transform(df[['Transport']])
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur

In [40]:
for column in df.columns:
    if  df.dtypes[column] != object:
        df[column] = transformer.fit_transform(df[[column]])

In [41]:
df.head()

      Spend  Administration  Transport     Area    Profit
0  0.672530        0.345355   1.552016    Dhaka  1.698340
1  1.452113        0.697565   1.383714      Ctg  1.688874
2  1.303634       -0.524290   1.166654  Rangpur  1.673929
3  1.156567       -0.097977   1.017368    Dhaka  1.509736
4  1.119836       -0.761543   0.914576  Rangpur  1.172943

### How to select particular column from pandas dataframe

In [43]:
b=df.iloc[:,0:3] # Separate selected columns indexed 0,1,2. # iloc for integer indexed based on position
b.head(3)

      Spend  Administration  Transport
0  0.672530        0.345355   1.552016
1  1.452113        0.697565   1.383714
2  1.303634       -0.524290   1.166654

In [46]:
selected_columns=["Spend","Area"]
sc=df.loc[:,selected_columns]  # loc for label based indexed
sc.head()

      Spend     Area
0  0.672530    Dhaka
1  1.452113      Ctg
2  1.303634  Rangpur
3  1.156567    Dhaka
4  1.119836  Rangpur